# GetCurvesForBrowser Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..GetCurvesForBrowser Method
RebarShape Class See Also
---
Generate curves for the shape, as used in the shape browser.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public IList<Curve> GetCurvesForBrowser()
```

Visual Basic
---
```text
Public Function GetCurvesForBrowser As IList(Of Curve)
```

Visual C++
---
```text
public:
IList<Curve^>^ GetCurvesForBrowser()
```

# ### Return Value
An array of curves representing the shape with its default parameters.
# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace